https://github.com/jackmansur/IST210/blob/master/Screenshot%20(102).png?raw=true

In [0]:
import sqlite3 
#BOOK
connectionToDatabase = sqlite3.connect('LibraryData') 
cursor = connectionToDatabase.cursor()

cursor.execute('''drop table IF EXISTS book''')
connectionToDatabase.commit()
cursor.execute('''create table book (bookID real PRIMARY KEY, title text, numberAvailable real, employeeID real)''')
connectionToDatabase.commit()

In [0]:
#BOOK DATA
connectionToDatabase = sqlite3.connect('LibraryData') 
cursor = connectionToDatabase.cursor()

cursor.execute('''insert into book values ('21', 'Wuthering Heights', '2', '10' )''')
connectionToDatabase.commit()
cursor.execute('''insert into book values ('22', 'Pride and Predjudice', '4', '11' )''')
connectionToDatabase.commit()
cursor.execute('''insert into book values ('23', 'The Great Gatsby', '5', '12' )''')
connectionToDatabase.commit()
cursor.execute('''insert into book values ('24', 'The Grapes of Wrath', '1', '13' )''')
connectionToDatabase.commit()
cursor.execute('''insert into book values ('25', 'Heart of Darkness', '4', '14' )''')
connectionToDatabase.commit()

In [3]:
cursor.execute('''select * from book''')
for row in cursor.fetchall():
  print(row)

(21.0, 'Wuthering Heights', 2.0, 10.0)
(22.0, 'Pride and Predjudice', 4.0, 11.0)
(23.0, 'The Great Gatsby', 5.0, 12.0)
(24.0, 'The Grapes of Wrath', 1.0, 13.0)
(25.0, 'Heart of Darkness', 4.0, 14.0)

In [0]:
#BILL
connectionToDatabase = sqlite3.connect('LibraryData') 
cursor = connectionToDatabase.cursor()

cursor.execute('''drop table IF EXISTS bill''')
connectionToDatabase.commit()
cursor.execute('''create table bill (billID real PRIMARY KEY, userID real, price real, branchID real)''')
connectionToDatabase.commit()

In [0]:
#BILL DATA
connectionToDatabase = sqlite3.connect('LibraryData') 
cursor = connectionToDatabase.cursor()

cursor.execute('''insert into bill values ('31', '01', '12.32', '45' )''')
connectionToDatabase.commit()
cursor.execute('''insert into bill values ('32', '02', '3.43', '41' )''')
connectionToDatabase.commit()
cursor.execute('''insert into bill values ('33', '03', '2.65', '42' )''')
connectionToDatabase.commit()
cursor.execute('''insert into bill values ('34', '04', '15.32', '42' )''')
connectionToDatabase.commit()
cursor.execute('''insert into bill values ('35', '05', '9.23', '41' )''')
connectionToDatabase.commit()

In [6]:
cursor.execute('''select * from bill''')
for row in cursor.fetchall():
  print(row)

(31.0, 1.0, 12.32, 45.0)
(32.0, 2.0, 3.43, 41.0)
(33.0, 3.0, 2.65, 42.0)
(34.0, 4.0, 15.32, 42.0)
(35.0, 5.0, 9.23, 41.0)

In [0]:
#BRANCH
connectionToDatabase = sqlite3.connect('LibraryData') 
cursor = connectionToDatabase.cursor()
cursor.execute('''drop table IF EXISTS branch''')
connectionToDatabase.commit()

cursor.execute('''create table branch (branchID real PRIMARY KEY, location text, booksAvailable real, employeeID real)''')
connectionToDatabase.commit()

In [0]:
#BRANCH DATA
connectionToDatabase = sqlite3.connect('LibraryData') 
cursor = connectionToDatabase.cursor()

cursor.execute('''insert into branch values ('41', 'State College', '3454', '10' )''')
connectionToDatabase.commit()
cursor.execute('''insert into branch values ('42', 'Pittsburgh', '4325', '11' )''')
connectionToDatabase.commit()
cursor.execute('''insert into branch values ('43', 'New York', '7653', '12' )''')
connectionToDatabase.commit()
cursor.execute('''insert into branch values ('44', 'Washington D.C', '8970', '13' )''')
connectionToDatabase.commit()
cursor.execute('''insert into branch values ('45', 'Harrisburg', '5678', '14' )''')
connectionToDatabase.commit()

In [9]:
cursor.execute('''select * from branch''')
for row in cursor.fetchall():
  print(row)

(41.0, 'State College', 3454.0, 10.0)
(42.0, 'Pittsburgh', 4325.0, 11.0)
(43.0, 'New York', 7653.0, 12.0)
(44.0, 'Washington D.C', 8970.0, 13.0)
(45.0, 'Harrisburg', 5678.0, 14.0)

In [0]:
#EMPLOYEE
connectionToDatabase = sqlite3.connect('LibraryData') 
cursor = connectionToDatabase.cursor()
cursor.execute('''drop table IF EXISTS employee''')
connectionToDatabase.commit()

cursor.execute('''create table employee (employeeID real PRIMARY KEY, firstName text, lastName text, hours real)''')
connectionToDatabase.commit()

In [0]:
#EMPLOYEE DATA
connectionToDatabase = sqlite3.connect('LibraryData') 
cursor = connectionToDatabase.cursor()

cursor.execute('''insert into employee values ('10', 'Matt', 'Trimble', '47' )''')
connectionToDatabase.commit()
cursor.execute('''insert into employee values ('11', 'Becca', 'Densmore', '32' )''')
connectionToDatabase.commit()
cursor.execute('''insert into employee values ('12', 'Joe', 'Plunket', '23' )''')
connectionToDatabase.commit()
cursor.execute('''insert into employee values ('13', 'Bridget', 'Brown', '18' )''')
connectionToDatabase.commit()
cursor.execute('''insert into employee values ('14', 'Julie', 'Smith', '24' )''')
connectionToDatabase.commit()

In [12]:
cursor.execute('''select * from employee''')
for row in cursor.fetchall():
  print(row)

(10.0, 'Matt', 'Trimble', 47.0)
(11.0, 'Becca', 'Densmore', 32.0)
(12.0, 'Joe', 'Plunket', 23.0)
(13.0, 'Bridget', 'Brown', 18.0)
(14.0, 'Julie', 'Smith', 24.0)

In [0]:
#USER
connectionToDatabase = sqlite3.connect('LibraryData') 
cursor = connectionToDatabase.cursor()
cursor.execute('''drop table IF EXISTS user''')
connectionToDatabase.commit()

cursor.execute('''create table user (userID real PRIMARY KEY, firstName text, lastName text, bookID real)''')
connectionToDatabase.commit()

In [0]:
#USER DATA
connectionToDatabase = sqlite3.connect('LibraryData') 
cursor = connectionToDatabase.cursor()

cursor.execute('''insert into user values ('01', 'Hannah', 'Kern', '67324' )''')
connectionToDatabase.commit()
cursor.execute('''insert into user values ('02', 'Luke', 'Devine', '32147' )''')
connectionToDatabase.commit()
cursor.execute('''insert into user values ('03', 'Jack', 'Mansur', '23147' )''')
connectionToDatabase.commit()
cursor.execute('''insert into user values ('04', 'Corina', 'Brems', '98432' )''')
connectionToDatabase.commit()
cursor.execute('''insert into user values ('05', 'Sean', 'Lawrence', '73279' )''')
connectionToDatabase.commit()

In [15]:
cursor.execute('''select * from user''')
for row in cursor.fetchall():
  print(row)

(1.0, 'Hannah', 'Kern', 67324.0)
(2.0, 'Luke', 'Devine', 32147.0)
(3.0, 'Jack', 'Mansur', 23147.0)
(4.0, 'Corina', 'Brems', 98432.0)
(5.0, 'Sean', 'Lawrence', 73279.0)

How many books are available in all the locations combined?

In [16]:
cursor.execute('''select SUM(booksAvailable) from branch''')
for row in cursor.fetchall():
  print(row)

(30080.0,)

This question is important because it gives information on how many books that can be found in the whole database. By knowing this user can be more willing to use the database to find the book that they want because it is more likely to have it. The database also knows how much information it may need to handle.

List all of the bills from the Pittsburgh branch

In [17]:
cursor.execute('''select * from bill where branchID = 42''')
for row in cursor.fetchall():
  print(row)

(33.0, 3.0, 2.65, 42.0)
(34.0, 4.0, 15.32, 42.0)

By knowing all of the bills from the pittsburgh branch, employees can review them. This way they can easily find out which ones have been paid or when they are due. It will become much easier to know more about the specific bills. They can understand information clearer and sort it without worrying about information they don't need.

What are the book with titles that contain "the"?

In [18]:
cursor.execute('''select * from book WHERE title LIKE "%the%"''')
for row in cursor.fetchall():
  print(row)

(21.0, 'Wuthering Heights', 2.0, 10.0)
(23.0, 'The Great Gatsby', 5.0, 12.0)
(24.0, 'The Grapes of Wrath', 1.0, 13.0)

Users can easily search for books they want using keywords. They will be able to find books that they could be interested in by looking up keywords that they might want to read.They will then be more inclined to use the library because they will know that the library has books they want to read.